оаопр/УпрГост/src/Documents/СчетНаВозврат/СчетНаВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетНаВозврат</name>
  <basedOn>Document.ВыбытиеГостя</basedOn>
  <registerRecords>AccumulationRegister.Оплаты</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВыбытиеГостя</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозвратаСоСкидкой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

оаопр/УпрГост/src/Documents/СчетНаВозврат/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыбытиеГостя") Тогда
		// Заполнение шапки
		ДокументОснование=ДанныеЗаполнения.Ссылка;
		Клиент = ДанныеЗаполнения.Клиент;
		Организация = ДанныеЗаполнения.Организация;
		СуммаВозврата = ДанныеЗаполнения.СтоимостьПроживанияРанее-ДанныеЗаполнения.СтоимостьПроживания;
		СуммаВозвратаСоСкидкой=ДанныеЗаполнения.СтоимостьПроживанияСоСкидкойРанее-ДанныеЗаполнения.СтоимостьПроживанияСоСкидкой;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Оплаты 
	Движения.Оплаты.Записывать = Истина;
	Движение = Движения.Оплаты.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	
	Движение.Сумма = -СуммаВозврата;
    Движение.СуммаСоСкидкой = -СуммаВозвратаСоСкидкой;
    
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
